justimepassnow/custom_servo/mm32_test/pack_extracted/SVD/MM32G0001.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CRC</name>
			<description>CRC calculation unit</description>
			<groupName>CRC</groupName>
			<baseAddress>0x40023000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Data register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DR</name>
							<description>Data register bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>Independent data register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>IDR</name>
							<description>General-purpose 8-bit data register bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<displayName>CTRL</displayName>
					<description>Control register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RESET</name>
							<description>CRC reset</description>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DBG</name>
			<description>Debug support</description>
			<groupName>DBG</groupName>
			<baseAddress>0x40013400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>IDCODE</name>
					<displayName>IDCODE</displayName>
					<description>ID CODE</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>DEV_ID</name>
							<description>Device identifier</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DBG_TIM14_STOP</name>
							<description>TIM14 counter stopped when core is halted</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIM3_PWM_OFF</name>
							<description>TIM3 PWM ouput 0 when core is halted</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIM1_PWM_OFF</name>
							<description>TIM1 PWM ouput 0 when core is halted</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIM3_STOP</name>
							<description>TIM3 counter stopped when core is halted</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_TIM1_STOP</name>
							<description>TIM1 counter stopped when core is halted</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_IWDG_STOP</name>
							<description>Debug independent watchdog stopped when core is stopped</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP_FOR_LDO</name>
							<description>Debug Stop Ldo</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_STOP</name>
							<description>Debug Stop mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DBG_SLEEP</name>
							<description>Can be configured as any channel from ch0 to 9, 14 to 15.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>DEVICE</name>
			<description>DEVICE</description>
			<groupName>DEVICE</groupName>
			<baseAddress>0x1FFFF7E8</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>UID1</name>
					<displayName>UID1</displayName>
					<description>Configuration register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>U_ID</name>
							<description>31:0 unique ID bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>UID2</name>
					<displayName>UID2</displayName>
					<description>Configuration register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>U_ID</name>
							<description>63:32 unique ID bits</description>
						</field>
					</fields>
				</register>
				<register>
					<name>UID3</name>
					<displayName>UID3</displayName>
					<description>Configuration register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>U_ID</name>
							<description>95:64 unique ID bits</description>
						</field>
					</fields>
				</register>
