justimepassnow/custom_servo/mm32_test/pack_extracted/SVD/MM32G0001.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>FLASH</name>
			<description>FLASH</description>
			<groupName>FLASH</groupName>
			<baseAddress>0x40022000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>FLASH</name>
				<description>Flash global interrupt</description>
				<value>3</value>
			</interrupt>
			<registers>
				<register>
					<name>ACR</name>
					<displayName>ACR</displayName>
					<description>Flash access control register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000010</resetValue>
					<fields>
						<field>
							<name>PRFTBS</name>
							<description>Prefetch buffer status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PRFTBE</name>
							<description>Prefetch buffer enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HLFCYA</name>
							<description>Flash half cycle access enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LATENCY</name>
							<description>Latency</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYR</name>
					<displayName>KEYR</displayName>
					<description>Flash key</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>FKEYR</name>
							<description>Flash key</description>
						</field>
					</fields>
				</register>
				<register>
					<name>OPTKEYR</name>
					<displayName>OPTKEYR</displayName>
					<description>Option byte key</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>OPTKEYR</name>
							<description>Option byte key</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Flash status register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EOP</name>
							<description>End of operation</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WRPRTERR</name>
							<description>Write protection error</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PGERR</name>
							<description>Programming error</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BSY</name>
							<description>Busy</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Flash control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>EOPIE</name>
							<description>End of operation interrupt enable</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ERRIE</name>
							<description>Error interrupt enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTWRE</name>
							<description>Option byte write enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STRT</name>
							<description>Start</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTER</name>
							<description>Option byte erase</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTPG</name>
							<description>Option byte programming</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MER</name>
							<description>Mass erase</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PER</name>
							<description>Page erase</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PG</name>
							<description>Programming</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AR</name>
					<displayName>AR</displayName>
					<description>Flash address register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<name>FAR</name>
							<description>Flash Address</description>
						</field>
					</fields>
				</register>
				<register>
					<name>OBR</name>
					<displayName>OBR</displayName>
					<description>Option byte register</description>
					<addressOffset>0x1c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x03FFFC6C</resetValue>
					<fields>
						<field>
							<name>Data1</name>
							<description>Data1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>Data0</name>
							<description>Data0</description>
							<bitOffset>10</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>nBOOT1</name>
							<description>User option bytes</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>nRST_STDBY</name>
							<description>User option bytes</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>nRST_STOP</name>
							<description>User option bytes</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WDG_SW</name>
							<description>User option bytes</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RDPRT</name>
							<description>Read protection level status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OPTERR</name>
							<description>Option byte error</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WRPR</name>
					<displayName>WRPR</displayName>
					<description>Write protect register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<name>WRP</name>
							<description>Write protect</description>
						</field>
					</fields>
				</register>
