justimepassnow/custom_servo/mm32_test/pack_extracted/SVD/MM32G0001.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GPIOB</name>
			<description>General purpose I/O</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x48000400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CRL</name>
					<displayName>CRL</displayName>
					<description>configuration low register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x44444444</resetValue>
					<fields>
						<field>
							<name>CNF1</name>
							<description>Port 1 configuration bits</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE1</name>
							<description>Port 1 mode bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CNF0</name>
							<description>Port 0 configuration bits</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MODE0</name>
							<description>Port 0 mode bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>input data register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>IDR</name>
							<description>Port input data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ODR</name>
					<displayName>ODR</displayName>
					<description>output data register</description>
					<addressOffset>0x0C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>ODR</name>
							<description>Port output data</description>
						</field>
					</fields>
				</register>
				<register>
					<name>BSRR</name>
					<displayName>BSRR</displayName>
					<description>bit set/reset register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR1</name>
							<description>Port x Reset bit 1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR0</name>
							<description>Port x Reset bit 0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS1</name>
							<description>Port x Set bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS0</name>
							<description>Port x Set bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>bit reset register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR1</name>
							<description>Port x Reset bit 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR0</name>
							<description>Port x Reset bit 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LCKR</name>
					<displayName>LCKR</displayName>
					<description>Port configuration lock register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LCKK</name>
							<description>Lock key</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK</name>
							<description>Port x Lock bit y</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DCR</name>
					<displayName>DCR</displayName>
					<description>Port output open drain control register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>PX1</name>
							<description>PX1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>PX0</name>
							<description>PX0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFRL</name>
					<displayName>AFRL</displayName>
					<description>Port Multiplexing Function Low Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>AFR7</name>
							<description>Multiplexing function selection for bit 7 of portx</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR6</name>
							<description>Multiplexing function selection for bit 6 of portx</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR5</name>
							<description>Multiplexing function selection for bit 5 of portx</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR4</name>
							<description>Multiplexing function selection for bit 4 of portx</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR3</name>
							<description>Multiplexing function selection for bit 3 of portx</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR2</name>
							<description>Multiplexing function selection for bit 2 of portx</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR1</name>
							<description>Multiplexing function selection for bit 1 of portx</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR0</name>
							<description>Multiplexing function selection for bit 0 of portx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFRH</name>
					<displayName>AFRH</displayName>
					<description>Port Multiplexing Function High Register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xF00FFFFF</resetValue>
					<fields>
						<field>
							<name>AFR15</name>
							<description>Multiplexing function selection for bit 15 of portx</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR14</name>
							<description>Multiplexing function selection for bit 14 of portx</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR13</name>
							<description>Multiplexing function selection for bit 13 of portx</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR12</name>
							<description>Multiplexing function selection for bit 12 of portx</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR11</name>
							<description>Multiplexing function selection for bit 11 of portx</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR10</name>
							<description>Multiplexing function selection for bit 10 of portx</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR9</name>
							<description>Multiplexing function selection for bit 9  of portx</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AFR8</name>
							<description>Multiplexing function selection for bit 8  of portx</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
