justimepassnow/custom_servo/mm32_test/pack_extracted/SVD/MM32G0001.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>I2C1</name>
			<description>Inter integrated circuit</description>
			<groupName>I2C</groupName>
			<baseAddress>0x40005400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>I2C1</name>
				<description>I2C1 interrupt</description>
				<value>23</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x007F</resetValue>
					<fields>
						<field>
							<name>EMPINT</name>
							<description>This bit controls the generation of the TX_EMPTY interrupt</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOPINT</name>
							<description>STOP_DET_IFADDRESSED</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DISSLAVE</name>
							<description>This bit controls whether I2C has its slave diabled</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPEN</name>
							<description>Determines whether RESTART comdtions may be sent when acting as a master</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MASTER10</name>
							<description>Address mode when acting as a master</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SLAVE10</name>
							<description>When acting as a alsve</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SPEED</name>
							<description>These bits control at which speed the DW_apb_i2c operates</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MASTER</name>
							<description>This bit controls whether the DW_apb_i2c master is enabled</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TAR</name>
					<displayName>TAR</displayName>
					<description>Target Register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0055</resetValue>
					<fields>
						<field>
							<name>SPECIAL</name>
							<description>This bit indicates whether software performs a General Call or START BYTE conmmend</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GC</name>
							<description>If bit 11(SPECIAL)is set to 1</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADDR</name>
							<description>This is the target address for any master transaction</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SAR</name>
					<displayName>SAR</displayName>
					<description>Slave Address Register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0055</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<name>ADDR</name>
							<description>The SAR holds the slave address when the i2c is operation as a slave</description>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>Data Command Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>RESTART</name>
							<description>This bit controls whether RESTART is generated before send or receive byte</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOP</name>
							<description>This bit controls whether STOP is generated after send or receive byte.</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMD</name>
							<description>This bit controls whether a read or a write is perormed</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAT</name>
							<description>This register contains the data to be transimitted or received on the i2c bus.</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SSHR</name>
					<displayName>SSHR</displayName>
					<description>SCL High Period Count for Std. Speed Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0190</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>This register sets the SCL clock high period count for standard speed</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SSLR</name>
					<displayName>SSLR</displayName>
					<description>SCL Low Period Count for Std. Speed Register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x01D6</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>This register sets the SCL clock low period count for standard speed</description>
						</field>
					</fields>
				</register>
				<register>
					<name>FSHR</name>
					<displayName>FSHR</displayName>
					<description>SCL High Period Count for Fast Speed Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0036</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>This register sets the SCL clock high_period count for standard speed</description>
						</field>
					</fields>
				</register>
				<register>
					<name>FSLR</name>
					<displayName>FSLR</displayName>
					<description>SCL Low Period Count for Fast Speed Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0082</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>CNT</name>
							<description>This register sets the SCL clock low period count for standard speed</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>Interrupt Status Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<name>ISR</name>
							<description>Specific bit description refer to RAWISR</description>
						</field>
					</fields>
				</register>
				<register>
					<name>IMR</name>
					<displayName>IMR</displayName>
					<description>Interrupt Mask Register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x08FF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>11</bitWidth>
							<name>IMR</name>
							<description>Specific bit description shield RAWISR</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RAWISR</name>
					<displayName>RAWISR</displayName>
					<description>RAW Interrupt Status Register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>HOLD</name>
							<description>MST_ON_HOLD interrupt status</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESTART</name>
							<description>RESTART_DET interrupt status</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>GC</name>
							<description>General call</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>START</name>
							<description>Start condition detection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>STOP</name>
							<description>Stop condition detection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACTIV</name>
							<description>This bit captures DW_spb_i2c acticity and stays set until it is cleared</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_DONE</name>
							<description>Transmit done</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_ABRT</name>
							<description>Transmit abort</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RD_REQ</name>
							<description>Read request</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_EMPTY</name>
							<description>Transmit buffer empty</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TX_OVER</name>
							<description>Transmit buffer over</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_FULL</name>
							<description>Receive buffer not empty</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_OVER</name>
							<description>Receive buffer over</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RX_UNDER</name>
							<description>Receive buffer under</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTLR</name>
					<displayName>RXTLR</displayName>
					<description>Receive FIFO Threshold Level Register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>TL</name>
							<description>Receive FIFO threshold level</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TXTLR</name>
					<displayName>TXTLR</displayName>
					<description>Transmit FIFO Threshold Level Register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>TL</name>
							<description>Transmit FIFO threshold level</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<displayName>ICR</displayName>
					<description>Clear All Interrupt Register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>ICR</name>
							<description>Read this register to clear the combined interrupt</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_UNDER</name>
					<displayName>RX_UNDER</displayName>
					<description>Clear RX_UNDER Interrupt Register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RX_UNDER</name>
							<description>Read this register to clear the RX_UNDER interrupt(bit 0)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OVER</name>
					<displayName>RX_OVER</displayName>
					<description>Clear RX_OVER Interrupt Register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RX_OVER</name>
							<description>Read this register to clear the RX_UNDER interrupt(bit 1)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OVER</name>
					<displayName>TX_OVER</displayName>
					<description>Clear TX_OVER Interrupt Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>TX_OVER</name>
							<description>Read this register to clear the RX_UNDER interrupt(bit 3)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RD_REQ</name>
					<displayName>RD_REQ</displayName>
					<description>Clear RD_REQ Interrupt Register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RD_REQ</name>
							<description>Read this register to clear the RX_UNDER interrupt(bit 5)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_ABRT</name>
					<displayName>TX_ABRT</displayName>
					<description>Clear TX_ABRT Interrupt Register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>TX_ABRT</name>
							<description>Read this register to clear the RX_UNDER interrupt(bit 6)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_DONE</name>
					<displayName>RX_DONE</displayName>
					<description>Clear RX_DONE Interrupt Register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>RX_DONE</name>
							<description>Read this register to clear the RX_UNDER interrupt(bit 7)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ACTIV</name>
					<displayName>ACTIV</displayName>
					<description>Clear ACTIVITY Interrupt Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>ACTIV</name>
							<description>Reading this register clears the ACTIVITY interrupt if the I2C is not active anymore</description>
						</field>
					</fields>
				</register>
				<register>
					<name>STOP</name>
					<displayName>STOP</displayName>
					<description>Clear STOP_DET Interrupt Register</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>STOP</name>
							<description>Read this register to clear the STOP_DET interrupt(bit 9)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>START</name>
					<displayName>START</displayName>
					<description>Clear START_DET Interrupt Register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>START</name>
							<description>Read this register to clear the START_DET interrupt(bit 10)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GC</name>
					<displayName>GC</displayName>
					<description>Clear GEN_CALL Interrupt Register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>GC</name>
							<description>Read this register to clear the GEN_CALL interrupt(bit 11)of the RAWISR register</description>
						</field>
					</fields>
				</register>
				<register>
					<name>ENR</name>
					<displayName>ENR</displayName>
					<description>Enable Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>ABORT</name>
							<description>I2C transfer abort</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENABLE</name>
							<description>I2C mode enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status Register</description>
					<addressOffset>0x70</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0006</resetValue>
					<fields>
						<field>
							<name>SLV_ACTIV</name>
							<description>Slave FSM activity status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MST_ACTIV</name>
							<description>Master FSM activity status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RFF</name>
							<description>Receive FIFO completely full</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RFNE</name>
							<description>Receive FIFO not empty</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TFE</name>
							<description>Transmit FIFO completely empty</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TFNF</name>
							<description>Transmit FIFO not full</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ACTIV</name>
							<description>I2C activity status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TXFLR</name>
					<displayName>TXFLR</displayName>
					<description>Transmit FIFO Level Register</description>
					<addressOffset>0x74</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<name>CNT</name>
							<description>Transmit FIFO level.Contains the number of valid data entires in the transmit FIFO</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RXFLR</name>
					<displayName>RXFLR</displayName>
					<description>Receive FIFO Level Register</description>
					<addressOffset>0x78</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<name>CNT</name>
							<description>Receive FIFO level. Contains the number of valid data entires in the receive FIFO</description>
						</field>
					</fields>
				</register>
				<register>
					<name>HOLD</name>
					<displayName>HOLD</displayName>
					<description>SDA Hold Time Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<name>RX_HOLD</name>
							<description>Sets the required SDA hold time in units of ic_clk period</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>TX_HOLD</name>
							<description>Sets the required SDA hold time in units of ic_clk period</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SETUP</name>
					<displayName>SETUP</displayName>
					<description>SDA Setup Time Register</description>
					<addressOffset>0x94</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0064</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<name>CNT</name>
							<description>SDA setup</description>
						</field>
					</fields>
				</register>
				<register>
					<name>GCR</name>
					<displayName>GCR</displayName>
					<description>ACK General Call Register</description>
					<addressOffset>0x98</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0001</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<name>GC</name>
							<description>ACK general call</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SLVMASK</name>
					<displayName>SLVMASK</displayName>
					<description>Slave mask Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x03FF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<name>MASK</name>
							<description>Slave address mask.</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SLVRCVADDR</name>
					<displayName>SLVRCVADDR</displayName>
					<description>Slave received address Register</description>
					<addressOffset>0xB4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<name>ADDR</name>
							<description>Slave actual received address.</description>
						</field>
					</fields>
				</register>
