justimepassnow/custom_servo/mm32_test/pack_extracted/SVD/MM32G0001.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>IWDG</name>
			<description>Independent watchdog</description>
			<groupName>IWDG</groupName>
			<baseAddress>0x40003000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>KR</name>
					<displayName>KR</displayName>
					<description>Key register</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<name>KEY</name>
							<description>Key value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>PR</name>
					<displayName>PR</displayName>
					<description>Prescaler register</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<name>PR</name>
							<description>Prescaler divider</description>
						</field>
					</fields>
				</register>
				<register>
					<name>RLR</name>
					<displayName>RLR</displayName>
					<description>Reload register</description>
					<addressOffset>0x08</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000FFF</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<name>RL</name>
							<description>Watchdog counter reload value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<displayName>SR</displayName>
					<description>Status register</description>
					<addressOffset>0x0c</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x000000000</resetValue>
					<fields>
						<field>
							<name>UPDATE</name>
							<description>Watchdog Reloads Update Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IVU</name>
							<description>Watchdog interrupt generate value update</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RVU</name>
							<description>Watchdog counter reload value update</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVU</name>
							<description>Watchdog prescaler value update</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>Control register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IRQ_CLR</name>
							<description>Interruput clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IRQ_SEL</name>
							<description>Interruput select</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IGEN</name>
					<displayName>IGEN</displayName>
					<description>Interruput generate value register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<name>IGEN</name>
							<description>Watchdog Interrupt Generate value</description>
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<displayName>CNT</displayName>
					<description>Counter</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Current value of watchdog counter</description>
							<bitOffset>8</bitOffset>
							<bitWidth>11</bitWidth>
						</field>
						<field>
							<name>PS</name>
							<description>Watchdog prescaler counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>PWR</name>
			<description>Power control</description>
			<groupName>PWR</groupName>
			<baseAddress>0x40007000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>PVD</name>
				<description>PVD through EXTI line detection interrupt</description>
				<value>1</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>CR</description>
					<addressOffset>0x00</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PLS</name>
							<description>PVD level selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>PVDE</name>
							<description>Power voltage detector enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LPDS</name>
							<description>Power down deepsleep</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>CSR</description>
					<addressOffset>0x04</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PVDO</name>
							<description>PVD output</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
